app/Controllers/AdminNoticiasController.php

    public function index()
    {
        helper('auth');
        helper('text');
        $db = \Config\Database::connect();
        $query = $db->table('noticias');
        $query->select('noticias.*, categorias.nombre as categorias');
        $query->join('categorias', 'noticias.id_categoria = categorias.id');
        $query->orderBy('noticias.subido_el', 'DESC');
        $noticias = $query->get()->getResultArray();
---
SELECT "noticias".*, "categorias"."nombre" as "categorias"
FROM "noticias"
JOIN "categorias" ON "noticias"."id_categoria" = "categorias"."id"
ORDER BY "noticias"."subido_el" DESC