app/Controllers/EquipoController.php

    public function index()
    {
        helper('text');
        $db = \Config\Database::connect();
        $query = $db->table('colaboradores');
        $query->select('colaboradores.*, cargos.nombre as cargo');
        $query->join('cargos', 'colaboradores.id_cargo = cargos.id');
        $funcionarios = $query->get()->getResultArray();
---
SELECT "colaboradores".*, "cargos"."nombre" as "cargo"
FROM "colaboradores"
JOIN "cargos" ON "colaboradores"."id_cargo" = "cargos"."id"