app/Controllers/Home.php

SELECT *
FROM "noticias"
ORDER BY "id" DESC
 LIMIT 3
SELECT *
FROM "partner"
---
    public function index()
    {
        helper('text');
        $noticias = $this->noticiasModel->orderBy('id','DESC')->findAll(3);
        $partners = $this->partnerModel->findAll();