app/Controllers/NoticiasController.php

    public function index()
    {
        helper('text');
        $noticias = $this->noticiasModel->where('id_categoria',1)->orderBy('id', 'DESC')->paginate(12, 'group1');
---
SELECT *
FROM "noticias"
WHERE "id_categoria" = 1
ORDER BY "id" DESC
 LIMIT 12
SELECT COUNT(*) AS "numrows"
FROM "noticias"
WHERE "id_categoria" = 1

    public function view($id)
    {
        $noticia = $this->noticiasModel->where('id_categoria',1)->find($id);
---
SELECT *
FROM "noticias"
WHERE "id_categoria" = 1
AND "noticias"."id" = '72'