app/Controllers/QSController.php

    public function index()
    {
        helper('text');
        $quienes_somos = $this->info_cmm->find(1);
        $mision = $this->info_cmm->find(2);
        $vision = $this->info_cmm->find(3);
---
SELECT *
FROM "info_cmm"
WHERE "info_cmm"."id" = 1
SELECT *
FROM "info_cmm"
WHERE "info_cmm"."id" = 2
SELECT *
FROM "info_cmm"
WHERE "info_cmm"."id" = 3